# StructuralSectionAnalysisParams Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionAnalysisParams Constructor
StructuralSectionAnalysisParams Class See Also
---
Creates a new instance of StructuralSectionAnalysisParams.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public StructuralSectionAnalysisParams()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
StructuralSectionAnalysisParams()
```

# See Also
StructuralSectionAnalysisParams Class
StructuralSectionAnalysisParams Overload
Autodesk.Revit.DB.Structure.StructuralSections Namespace